In [39]:
import pandas as pd
import numpy as np
from datetime import datetime

In [8]:
str1 = '2024-01-01'
date1 = datetime.strptime(str1, '%Y-%m-%d')
date1

datetime.datetime(2024, 1, 1, 0, 0)

In [19]:
df1 = pd.DataFrame({
    'id': [ 101, 129, 120, 126, 136, 125],
    'age': [ 30, 32, 43, 45, 29, 46],
    'gender': ['F', 'M', 'M', 'M', 'F', 'F'],
    'is_active':[True, False,True, False,True, False]
    })
df1

    id  age gender  is_active
0  101   30      F       True
1  129   32      M      False
2  120   43      M       True
3  126   45      M      False
4  136   29      F       True
5  125   46      F      False

In [86]:
df3 = df1.loc[df1.index.isin([0,1,5])]
df3

    id  age gender  is_active
0  101   30      F          1
1  129   32      M          0
5  125   46      F          0

In [88]:
merged = pd.merge(df1,df3,how='left', indicator=True)
merged

    id  age gender  is_active     _merge
0  101   30      F          1       both
1  129   32      M          0       both
2  120   43      M          1  left_only
3  126   45      M          0  left_only
4  136   29      F          1  left_only
5  125   46      F          0       both

In [89]:
df1_not_in_df2 = merged.loc[merged._merge=='left_only']
df1_not_in_df2

    id  age gender  is_active     _merge
2  120   43      M          1  left_only
3  126   45      M          0  left_only
4  136   29      F          1  left_only

In [20]:
df1['is_active']=df1['is_active'].astype(int)
df1

    id  age gender  is_active
0  101   30      F          1
1  129   32      M          0
2  120   43      M          1
3  126   45      M          0
4  136   29      F          1
5  125   46      F          0

In [36]:
print(list(df1.columns))
print(list(df1.columns.values))
print('sorted: ',sorted(df1))
print('max id: ',df1['age'].idxmax())
df1.select_dtypes(include=['bool'])

['id', 'age', 'gender', 'is_active']
['id', 'age', 'gender', 'is_active']
sorted:  ['age', 'gender', 'id', 'is_active']
max id:  5

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5]

In [42]:
ser = pd.Series(['cat', 'dog', 'rabbit', 123, np.nan, 'cat', 456])
print(ser)
ser_mapped =ser.map({'cat':'kitten', 123: 999})
ser_mapped

0       cat
1       dog
2    rabbit
3       123
4       NaN
5       cat
6       456
dtype: object

0    kitten
1       NaN
2       NaN
3       999
4       NaN
5    kitten
6       NaN
dtype: object

In [12]:
ser = pd.Series([1,2,3,4,5,6,7,8])
df2= ser.to_frame('column1')
df2

   column1
0        1
1        2
2        3
3        4
4        5
5        6
6        7
7        8

In [59]:
df2= pd.DataFrame({'ids':[16,18,14,4,5], 'col1':[16,9,7,89,4]})
df2

   ids  col1
0   16    16
1   18     9
2   14     7
3    4    89
4    5     4

In [83]:
df2.applymap(lambda x: x**2)
df2['sqrt_ids'] = df2['ids'].apply(np.sqrt)
df2['a_by_b'] = df2.apply(lambda row:func2(row['ids'], row['col1']), axis=1)
df2

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_27104\2249445892.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df2.applymap(lambda x: x**2)

   ids  col1  sqrt_ids  a_by_b
0   16    16  4.000000    1.00
1   18     9  4.242641    2.00
2   14     7  3.741657    2.00
3    4    89  2.000000    0.04
4    5     4  2.236068    1.25

In [75]:
def func2(a, b):
    c= round(a/b, 2)
    return c

In [82]:
data = pd.DataFrame.from_records([[0,'A'], [0,'B'], [1,'A'], [1, 'B'], [1, 'C'], [2,'A'],[2,'B'],[2,'E'],[2,'D']], columns= ['number_records', 'category'])
data.pivot_table(index='number_records', columns=['category'], aggfunc=[len], fill_value=0)

               len
category         A  B  C  D  E
number_records
0                1  1  0  0  0
1                1  1  1  0  0
2                1  1  0  1  1

In [84]:
df2

   ids  col1  sqrt_ids  a_by_b
0   16    16  4.000000    1.00
1   18     9  4.242641    2.00
2   14     7  3.741657    2.00
3    4    89  2.000000    0.04
4    5     4  2.236068    1.25